# Workshop Lecture 7, Exercise 1
### Data Cleaning
Before doing actual data analysis, we usually first need to clean the data. This might involve steps such as dealing with missing values and encoding categorical variables as integers.

Load the Titanic data set in titanic.csv and perform the following tasks:

1. Report the number of observations with missing Age, for example using isna().
2. Compute the average age in the data set. Use the following approaches and compare your results:
    1. Use the mean() method.
    2. Convert the Age column to a NumPy array using to_numpy(). Experiment with NumPy’s np.mean() and np.nanmean() to see if you obtain the same results.
3. Replace the all missing ages with the mean age you computed above, rounded to the nearest integer. Note that in “real” applications, replacing missing values with sample means is usually not a good idea.
4. Convert this updated Age column to integer type using astype().
5. Generate a new column Female which takes on the value one if Sex is equal to "female" and zero otherwise. This is called an indicator or dummy variable, and is preferrable to storing such categorical data as strings. Delete the original column Sex.
6. Save your cleaned data set as titanic-clean.csv using to_csv() with , as the field separator.
Tell to_csv() to not write the DataFrame index to the CSV file as it’s not needed in this example

In [97]:
import pandas as pd
import numpy as np

#load the titanic data set in titanic.csv
DATA_PATH = '/Users/lilapfageraas/Downloads/nhh/tech2/TECH2-H24/data'
file = pd.read_csv(f'{DATA_PATH}/titanic.csv')
df = pd.DataFrame(file)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss Laina",female,26.0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,NaN,S

In [98]:
#mean method for average age
type(df)

pandas.core.frame.DataFrame

In [99]:
#number of observations with missing age
df['Age'].isna().sum()

177

In [100]:
df['Age'].mean().round(2)

29.7

In [101]:
#numpy mean method for average age
df_NP = df['Age'].to_numpy()

In [102]:
np.mean(df_NP)

nan

In [103]:
np.nanmean(df_NP).round(2)

29.7

for just np.mean, nan is returned because nan is included in the caluclations. for np.nanmean(), the same number as when using the pandas .mean() is returned

In [104]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss Laina",female,26.0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss Margaret Edith",female,19.0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss Catherine Helen ""Carrie""",female,NaN,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,370376,7.7500,NaN,Q

In [105]:
mean = int(df['Age'].mean())
df['Age'] = df['Age'].fillna(mean)

In [106]:
#convert age column into integer type
df['Age'] = df['Age'].astype(int)
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss Laina",female,26,STON/O2. 3101282,7.9250,NaN,S

In [107]:
#we can make an idicator variable (returns True or False), as this will return 1 or 0 when the column is converted to an integer
is_female = (df['Sex'] == 'female')

#add a new column called 'Female' that is the variable is_female converted to integers
df['Female'] = is_female.astype(int)

#delete the Sex column
df.drop('Sex', axis=1, inplace=True) #this can also be done using del df['Sex']

In [108]:
fn_clean = f'{DATA_PATH}/titanic_cleaned.csv'
df.to_csv(fn_clean, sep=',', index=False)